codigneter4/app/Controllers/Home.php

    public function all($page = null)
    {
        $data = [];
        $table_name = '';
        $p_id = '';
        // Get the full base URL
        $request = service('request');
        $base = base_url();
        $slug = $url = $request->getUri()->getSegment(1);
        if(empty($page))
        {
            $url = 'home';
            $page = 'index.php';
        }
        // Check if the slug exists in the database
        $slug_data = $this->db->table("slugs")
            ->where("slug", $url)
            ->get()
            ->getResultObject();
---
SELECT *
FROM `slugs`
WHERE `slug` = 'home'


        $meta_data = load_meta_tags();
        $data['meta_data'] = $meta_data;
        $data['sitesetting'] = ($this->db->table('site_setting')->getWhere(["id"=>1,])->getRow());
---
SELECT *
FROM `site_setting`
WHERE `id` = 1