codigneter4/app/Views/admin/tbl_admin/edit.php

                            <label>Select Role</label>
                            <select class="form-control" required name="role">
                                <?php
                                $roleQuery = $this->db->table('role')->where('status', 1)->get();
---
SELECT *
FROM `role`
WHERE `status` = 1