codigneter4/app/Views/admin/tbl_admin/table.php

    $this->db = \Config\Database::connect();
    $i = 1;
    foreach ($ALLDATA as $key => $data) {
      $roleQuery = $this->db->table('role')->where('id', $data->role)->get();
---
SELECT *
FROM `role`
WHERE `id` = '10'