codigneter4/app/Controllers/admin_con/Tbl_admin.php

    public function update_dataURL($id)
    {
        check_controller_inner_access(1,3);
        $table_name = $this->arr_values['table_name'];

        $type = 2;
        $role = $this->request->getPost('role');

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $getrole_access = $this->db->table('role')->where('id',$role)->get();
---
SELECT *
FROM `role`
WHERE `id` = '10'