codigneter4/app/Helpers/custom_helper.php

   function getAdminId()
   {
       $db = \Config\Database::connect();
       $session = session();
       $adminSession = $session->get('admin');

       if (!$adminSession) {
           return null;
       }

       $admin_id = $adminSession['id'];
       $check = $db->table('tbl_admin')
           ->where('id', $admin_id)
           ->get()
           ->getRow();
---
SELECT *
FROM `tbl_admin`
WHERE `id` = '4'

    function load_meta_tags()
   {
       $html = '';

       $db = \Config\Database::connect();
       $request = \Config\Services::request();
       $url = $request->getUri()->getPath();

       if (empty($url)) {
           $url = 'home';
       }

       // Select meta fields
       $meta_select = "page_name, meta_title, meta_keyword, meta_description, meta_auther";

       // Fetch meta data
       $meta_data = $db->table("meta_tags")
           ->select($meta_select)
           ->where("slug", $url)
           ->get()
           ->getResultObject();
---
SELECT `page_name`, `meta_title`, `meta_keyword`, `meta_description`, `meta_auther`
FROM `meta_tags`
WHERE `slug` = '/1ADMINPANELS/codigneter4/'

   function activityRecord()
   {
       $sessionData = getAdminId();
       if (!$sessionData) {
           return redirect()->to(base_url('admin'));
       }

       $admin_id = $sessionData->id;
       $username = $sessionData->username;
       $password = $sessionData->password;

       $ip_address = service('request')->getIPAddress();
       $current_url = current_url();
       $date = date('Y-m-d');
       $time = date('h:i:s A');

       $insertData = [
           'ip_addreass'    => $ip_address,
           'url'            => $current_url,
           'date'           => $date,
           'time'           => $time,
           'admin_id'       => $admin_id,
           'admin_username' => $username,
           'admin_password' => $password
       ];

       $db = \Config\Database::connect();
       $builder = $db->table('activity_records');
       return $builder->insert($insertData);
---
INSERT INTO `activity_records` (`ip_addreass`, `url`, `date`, `time`, `admin_id`, `admin_username`, `admin_password`) VALUES ('::1', 'http://localhost/codigneter4/admin/tbl_admin/edit_page/5', '2025-03-12', '06:11:53 PM', '4', 'azmal12345', 'azmal12345')

    function get_user()
    {
        $session = session();
        $db = \Config\Database::connect();

        $userId = $session->get('admin')['id'] ?? null;

        if (!$userId) {
            return redirect()->to(base_url('admin'));
        }

        $user = $db->table('tbl_admin')->where('id', $userId)->get()->getRow();
---
SELECT *
FROM `tbl_admin`
WHERE `id` = '4'

    function check_controller_access($controller_id)
    {
        $db = \Config\Database::connect();
        $user = get_user()['full_detail'] ?? null;

        // If the user is not logged in, redirect to access denied
        if (!$user) {
            header("Location: " . base_url('admin/access_denied'));
            exit;
        }

        $role = $user->role;
        $type = $user->type;


        if ($type == 1) {
            return true;
        }

        // Get role access data
        $role_data = $db->table('role')->where('id', $role)->get()->getRow();
---
SELECT *
FROM `role`
WHERE `id` = '10'

    function check_controller_inner_access($controller_id, $inner_id)
    {
        $db = \Config\Database::connect();
        $user = get_user()['full_detail'] ?? null;

        // If the user is not logged in, redirect and stop execution
        if (!$user) {
            header("Location: " . base_url('admin/access_denied'));
            exit;
        }

        $role = $user->role;
        $type = $user->type;

        // Super admin (type == 1) has full access
        if ($type == 1) {
            return true;
        }

        // Get role access data
        $role_data = $db->table('role')->where('id', $role)->get()->getRow();
---
SELECT *
FROM `role`
WHERE `id` = '10'