codigneter4/app/Views/website/index.php

    <th>Country</th>
  </tr>
  <?php
  $slider = $db->table('slider')
 	 	->orderBy('id', 'desc')
  		->getWhere(["status"=>1,])
  		->getResult();
---
SELECT *
FROM `slider`
WHERE `status` = 1
ORDER BY `id` DESC