codigneter4/app/Views/admin/include/allcss.php

SELECT *
FROM `site_setting`
WHERE `id` = 1
---
<?php
$db = \Config\Database::connect();
$siteSetting = $db->table('site_setting')->where(['id' => 1])->get()->getRow();