codigneter4/app/Views/admin/include/sidebar.php


$db = \Config\Database::connect();
$currentURI = uri_string();
$siteSetting = $db->table('site_setting')->where('id', 1)->get()->getRow();
---
SELECT *
FROM `site_setting`
WHERE `id` = 1